introduction.org
#+title: Docker for the Absolute Beginner - Hands-On
#+SETUPFILE: https://fniessen.github.io/org-html-themes/org/theme-readtheorg.setup


* Install Docker (Linux):
[[https://docs.docker.com/get-docker/][Docs docker]]

* An image for use in the Docker demo tutorial
[[https://hub.docker.com/r/docker/whalesay][Docker hub: image whalesay]]

#+begin_src shell
docker run docker/whalesay cowsay Hello-World
#+end_src

* Docker commands
** run - start a container
#+begin_src shell
docker run nginx
#+end_src

** ps - list container
#+begin_src shell
docker ps
#+end_src

#+RESULTS:
| CONTAINER    | ID    | IMAGE                | COMMAND | CREATED | STATUS | PORTS | NAMES |         |        |                 |
| 20871eb58c94 | nginx | /docker-entrypoint.… |       4 | seconds | ago    | Up    |     2 | seconds | 80/tcp | vigorous_wright |

#+begin_src shell
#docker ps -a
#+end_src

** stop - stop a container
#+begin_src shell
docker stop 20871eb58c94
docker stop {{name}}
#+end_src

** rm - remove a container
#+begin_src shell
docker rm sleepy_carson
#+end_src

** images - list images
#+begin_src shell
docker images
#+end_src

#+RESULTS:
| REPOSITORY                                                           | TAG     | IMAGE        | ID | CREATED | SIZE |        |
| nginx                                                                | latest  | 904b8cb13b93 |  9 | days    | ago  | 142MB  |

** rmi - remove images
#+begin_src shell
docker rmi nginx
#+end_src

#+RESULTS:
| Untagged: | nginx:latest                                                                  |
| Untagged: | nginx@sha256:aa0afebbb3cfa473099a62c4b32e9b3fb73ed23f2a75a65ce1d4b4f55a5c2ef2 |
| Deleted:  | sha256:904b8cb13b932e23230836850610fa45dce9eb0650d5618c2b1487c2a4f577b8       |

** pull - download an image
#+begin_src shell
docker pull nginx
#+end_src

** exec - execute a command
#+begin_src shell
docker run ubunto
#docker run ubunto sleep 20
#+end_src

#+RESULTS:

#+begin_src shell
docker exec hopeful_poincare cat /etc/hosts
#+end_src

#+RESULTS:
| 127.0.0.1  | localhost                            |
| ::1        | localhost ip6-localhost ip6-loopback |
| fe00::0    | ip6-localnet                         |
| ff00::0    | ip6-mcastprefix                      |
| ff02::1    | ip6-allnodes                         |
| ff02::2    | ip6-allrouters                       |
| 172.17.0.2 | 69706fc392ca                         |

* Docker Run
** Run - Tag
#+begin_src shell
docker run redis
#+end_src

#+begin_src shell
docker run redis:4.0
#+end_src

#+begin_src shell
docker run kodekloud/simple-prompt-docker
#+end_src

#+RESULTS:
| Welcome! | Please | enter   | your | name: |
| Hello    | and    | Welcome | !    |       |

** Run - PORT mapping
#+begin_src
docker run -p 80:5000 kodekloud/webapp
#+end_src

#+begin_src shell
docker run -p 3306:3306 mysql
#+end_src

** Run - Volume mapping

#+begin_src shell
docker run mysql
#+end_src

#+begin_src shell
docker stop mysql
docker rm mysql
#+end_src

#+begin_src shell
docker run -v /opt/daradir:/var/lib/mysql mysql
#+end_src

** Inspect container
#+begin_src shell
docker inspect nostalgic_galois
#+end_src

** Container logs
#+begin_src shel
docker logs nostalgic_galois
#+end_src




* Hands-On Labs
[[https://kodekloud.com/courses/labs-docker-for-the-absolute-beginner-hands-on/][KodeKloud Hands-On Labs]]

** TODO Lesson content [1/8]
- [X] Labs: Basic Docker Commands-Beta
- [X] Labs: Docker Run Commands
- [X] Labs: Docker Images
- [X] Labs- Environment Variables
- [X] Labs- Command & Entrypoint
- [ ] Labs: Docker Compose
- [ ] Labs: Docker Storage
- [ ] Labs: Docker Networking
